aizatsyafiq/STM32WLE5CCU-with-LoRa/1-Nucleo (as reference)/2 - GS FSM/nucleo gs fsm event.c
	// RF_{IRQ0, IRQ1, IRQ2} pins
	GPIO_InitStruct.Pin = GPIO_PIN_3 | GPIO_PIN_5 | GPIO_PIN_8;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_USART2_UART_Init();
	MX_SUBGHZ_Init();
	/* USER CODE BEGIN 2 */

	BSP_LED_Init(LED_GREEN);
	BSP_LED_Init(LED_RED);

	RadioLoRaBandwidths_t currentBandwidth = Bandwidths[LORA_BANDWIDTH];
	uint32_t bandwidthHz = GetBandwidthInHz(currentBandwidth);

	HAL_Delay(2000);

	sprintf(uartBuff, "LORA_MODULATION\r\nLORA_BW=%lu Hz\r\nLORA_SF=%d\r\n", bandwidthHz, LORA_SPREADING_FACTOR);
	HAL_UART_Transmit(&huart2, (uint8_t *)uartBuff, strlen(uartBuff), HAL_MAX_DELAY);
	radioInit();

	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */

	// get random number
	uint32_t rnd = 0;
	SUBGRF_SetDioIrqParams(IRQ_RADIO_NONE, IRQ_RADIO_NONE, IRQ_RADIO_NONE, IRQ_RADIO_NONE);
	rnd = SUBGRF_GetRandom();

	fsm.state = STATE_NULL;
	fsm.subState = SSTATE_NULL;
	fsm.rxTimeout = 3000; // 3000 ms to 5000ms
	fsm.rxMargin = 200;   // 200 ms
	fsm.randomDelay = rnd >> 22; // [0, 1023] ms

	HAL_Delay(fsm.randomDelay);
	SUBGRF_SetDioIrqParams( IRQ_RX_DONE | IRQ_RX_TX_TIMEOUT | IRQ_CRC_ERROR,
			IRQ_RX_DONE | IRQ_RX_TX_TIMEOUT | IRQ_CRC_ERROR,
			IRQ_RADIO_NONE,
			IRQ_RADIO_NONE );
	SUBGRF_SetSwitch(RFO_LP, RFSWITCH_RX);
	SUBGRF_SetRx(fsm.rxTimeout << 6);
	fsm.state = STATE_MASTER;
	fsm.subState = SSTATE_RX;

	printUid(&huart2);

	//datetime
	uint32_t elapsedTimeSinceTimeChanged = 0; //+unix = elapsedTime - timeChange. timeChanged = current hal_tick when unix was changed
	uint32_t timeChangeInSeconds = 0;
	const uint32_t gmtPlus8Offset = 8 * 3600; //gmt+8 offset, add this to unix
    time_t unix_timestamp = 1730127496;
//   struct tm *local_time = localtime(&unix_timestamp);
    char time_str[17];
//   strftime(time_str, sizeof(time_str), "%d-%m-%Y %H:%M", local_time);
	char timeBuffer[44];
//	snprintf(timeBuffer, sizeof(timeBuffer), "Current datetime (GMT+8) : %s", time_str);
//	HAL_UART_Transmit(&huart2, (uint8_t *)timeBuffer, sizeof(timeBuffer), HAL_MAX_DELAY);

	//for GS FSM - using event
	char rxData[20];
	char selection = 'x';


	while (1)//AAAAAAAAAA
	{
		//GS FSM - using event
		showMenu(&huart2);
		while(selection == 'x'){
			if(HAL_UART_Receive(&huart2, (uint8_t *)rxData, 1, 0) == HAL_OK){
				char buffer[15];
				if(rxData[0] != '\0' && rxData[0] != EOF && rxData[0] != '\r' && rxData[0] != '\n'){
					selection = rxData[0];
					snprintf(buffer, sizeof(buffer), "Entered : %c\r\n", selection);
					HAL_UART_Transmit(&huart2, (uint8_t*)buffer, 13, HAL_MAX_DELAY);
				}
			}
		}

		switch(selection){
		case '1':
			//1 - TX MODE ------------------------------------------------------------------
			HAL_UART_Transmit(&huart2, (uint8_t *)"Tx MODE\r\n", 9, HAL_MAX_DELAY);
			SUBGRF_SetSwitch(RFO_LP, RFSWITCH_TX);
			SUBGRF_WriteRegister(0x0889, (SUBGRF_ReadRegister(0x0889) | 0x04));
			uint8_t payloadsize = 1; //1 byte
			char payload[2] = "A\0"; //size is payloadsize + 1
			packetParams.Params.LoRa.PayloadLength = payloadsize;
			SUBGRF_SetPacketParams(&packetParams);
			SUBGRF_SendPayload((uint8_t *)payload, payloadsize, 0);
			HAL_UART_Transmit(&huart2, (uint8_t *)payload, payloadsize, HAL_MAX_DELAY);
			HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);
			HAL_Delay(2500);
			HAL_UART_Transmit(&huart2, (uint8_t *)"Tx DONE\r\n\n", 10, HAL_MAX_DELAY);
			//2 - RX MODE ------------------------------------------------------------------
			HAL_UART_Transmit(&huart2, (uint8_t *)"Rx MODE\r\n", 9, HAL_MAX_DELAY);
			//for now, just finish the rx if received packet; no waiting for the whole timeout duration
			enterMasterRx(&fsm);
			eventReceptor = NULL;
			while (eventReceptor == NULL);
			eventReceptor(&fsm);
			break;
		case '2':
			printBoardInfo(&huart2);
			break;
		case '3':
			HAL_UART_Transmit(&huart2, (uint8_t*)"Enter UNIX time : ", 18, HAL_MAX_DELAY);
			uint8_t unixInputArray[10] = {0};
			uint8_t unixInputArrayCounter = 0;
			uint32_t newUnix = 0;
			while(1){
				if(HAL_UART_Receive(&huart2, (uint8_t *)rxData, 1, 0) == HAL_OK){
					char buffer[15];
					snprintf(buffer, sizeof(buffer), "%c", rxData[0]);
					HAL_UART_Transmit(&huart2, (uint8_t*)buffer, 1, HAL_MAX_DELAY);
					if(rxData[0] != '\0' &&
							rxData[0] != EOF &&
							rxData[0] != '\r' &&
							rxData[0] != '\n' &&
							rxData[0] >= '0' &&
							rxData[0] <= '9' ){
						//Convert char into int, save into array, increment counter for array, once at 10 digit,
						//save as unix, convert to time, save to timeBuffer
						//char to int
						unixInputArray[unixInputArrayCounter] = rxData[0] - '0';
						//+counter for array
						unixInputArrayCounter++;
						//if input 10 digit -> save the value into newUnix
						if(unixInputArrayCounter == 10){
							for(int i=0; i<10; i++){
								newUnix = newUnix * 10 + unixInputArray[i];
							}
							//save newUnix to unix_timestamp
							unix_timestamp = (time_t)newUnix;
							//get current time for time settings change, for
							//elapsedTimeSinceTimeChanged
							timeChangeInSeconds = (int)(HAL_GetTick()/1000);
							//end message, reset
							HAL_UART_Transmit(&huart2, (uint8_t*)"\nUNIX time change successful\r\n", 30, HAL_MAX_DELAY);
							break;
						}
					}else{
						//remove this:
						HAL_UART_Transmit(&huart2, (uint8_t*)"\nBad input. Back to menu.\r\n", 27, HAL_MAX_DELAY);
						//break/restart if input not valid
						break;
					}
				}
			}
			break;
		case '4':
			//new time = current unix time + seconds elapsed since last unix set
			elapsedTimeSinceTimeChanged = (int)(HAL_GetTick()/1000) - timeChangeInSeconds;
			time_t adjustedTime = unix_timestamp + gmtPlus8Offset + elapsedTimeSinceTimeChanged;
			struct tm *local_time = localtime(&adjustedTime);
			strftime(time_str, sizeof(time_str), "%d-%m-%Y %H:%M", local_time);
			snprintf(timeBuffer, sizeof(timeBuffer), "Current datetime (GMT+8) : %s", time_str);
			HAL_UART_Transmit(&huart2, (uint8_t *)timeBuffer, sizeof(timeBuffer), HAL_MAX_DELAY);
			break;
		case '0':
			showMenu(&huart2);
			break;
		default:
			HAL_UART_Transmit(&huart2, (uint8_t*)"INVALID SELECTION\n", 18, HAL_MAX_DELAY);
			break;
		}
		//reset selection
		selection = 'x';
		//END GS FSM - using event
	}
	/* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
	RCC_OscInitTypeDef RCC_OscInitStruct = {0};
	RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

	/** Configure LSE Drive Capability
	 */
	HAL_PWR_EnableBkUpAccess();
	__HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);
	/** Configure the main internal regulator output voltage
	 */
	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
	/** Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSE|RCC_OSCILLATORTYPE_MSI;
	RCC_OscInitStruct.LSEState = RCC_LSE_ON;
	RCC_OscInitStruct.MSIState = RCC_MSI_ON;
	RCC_OscInitStruct.MSICalibrationValue = RCC_MSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_11;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	{
		Error_Handler();
	}
	/** Configure the SYSCLKSource, HCLK, PCLK1 and PCLK2 clocks dividers
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK3|RCC_CLOCKTYPE_HCLK
			|RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1
			|RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_MSI;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
	RCC_ClkInitStruct.AHBCLK3Divider = RCC_SYSCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
	{
		Error_Handler();
	}
}

/* USER CODE BEGIN 4 */

void printUid(UART_HandleTypeDef *huart)
{
	uint32_t uid[3];
	char buffer[30];  // 8 chars for hex, 1 for '\r', 1 for '\n', 1 for null terminator

	uid[0] = HAL_GetUIDw0();
	uid[1] = HAL_GetUIDw1();
	uid[2] = HAL_GetUIDw2();

	//    for (int i = 0; i < 3; i++)
	//    {
	//        snprintf(buffer, sizeof(buffer), "%08lX\r\n", uid[i]);
	//        HAL_UART_Transmit(huart, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
	//    }

	//show only Device ID
	snprintf(buffer, sizeof(buffer), "UNIQUE ID : %08lX\r\n", uid[1]);
	HAL_UART_Transmit(huart, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
}

/**
 * @brief  Initialize the Sub-GHz radio and dependent hardware.
 * @retval None
 */
void radioInit(void)
{
	// Initialize the hardware (SPI bus, TCXO control, RF switch)
	SUBGRF_Init(RadioOnDioIrq);

	// Use DCDC converter if `DCDC_ENABLE` is defined in radio_conf.h
	// "By default, the SMPS clock detection is disabled and must be enabled before enabling the SMPS." (6.1 in RM0453)
	SUBGRF_WriteRegister(SUBGHZ_SMPSC0R, (SUBGRF_ReadRegister(SUBGHZ_SMPSC0R) | SMPS_CLK_DET_ENABLE));
	SUBGRF_SetRegulatorMode();

	// Use the whole 256-byte buffer for both TX and RX
	SUBGRF_SetBufferBaseAddress(0x00, 0x00);

	SUBGRF_SetRfFrequency(RF_FREQUENCY);
	SUBGRF_SetRfTxPower(TX_OUTPUT_POWER);
	SUBGRF_SetStopRxTimerOnPreambleDetect(false);

	SUBGRF_SetPacketType(PACKET_TYPE_LORA);

	SUBGRF_WriteRegister( REG_LR_SYNCWORD, ( LORA_MAC_PRIVATE_SYNCWORD >> 8 ) & 0xFF );
	SUBGRF_WriteRegister( REG_LR_SYNCWORD + 1, LORA_MAC_PRIVATE_SYNCWORD & 0xFF );

	ModulationParams_t modulationParams;
	modulationParams.PacketType = PACKET_TYPE_LORA;
	modulationParams.Params.LoRa.Bandwidth = Bandwidths[LORA_BANDWIDTH];
	modulationParams.Params.LoRa.CodingRate = (RadioLoRaCodingRates_t)LORA_CODINGRATE;
	modulationParams.Params.LoRa.LowDatarateOptimize = 0x00;
	modulationParams.Params.LoRa.SpreadingFactor = (RadioLoRaSpreadingFactors_t)LORA_SPREADING_FACTOR;
	SUBGRF_SetModulationParams(&modulationParams);

	packetParams.PacketType = PACKET_TYPE_LORA;
	packetParams.Params.LoRa.CrcMode = LORA_CRC_OFF; //ON to OFF
	packetParams.Params.LoRa.HeaderType = LORA_PACKET_FIXED_LENGTH; //LORA_PACKET_VARIABLE_LENGTH
	packetParams.Params.LoRa.InvertIQ = LORA_IQ_NORMAL;
	packetParams.Params.LoRa.PayloadLength = PAYLOADLENGTH; //0xFF to 7
	packetParams.Params.LoRa.PreambleLength = LORA_PREAMBLE_LENGTH;
	SUBGRF_SetPacketParams(&packetParams);

	//SUBGRF_SetLoRaSymbNumTimeout(LORA_SYMBOL_TIMEOUT);

	// WORKAROUND - Optimizing the Inverted IQ Operation, see DS_SX1261-2_V1.2 datasheet chapter 15.4
	// RegIqPolaritySetup @address 0x0736
	SUBGRF_WriteRegister( 0x0736, SUBGRF_ReadRegister( 0x0736 ) | ( 1 << 2 ) );
}


/**
 * @brief  Receive data trough SUBGHZSPI peripheral
 * @param  radioIrq  interrupt pending status information
 * @retval None
 */
void RadioOnDioIrq(RadioIrqMasks_t radioIrq)
{
	switch (radioIrq)
	{
	case IRQ_TX_DONE:
		eventReceptor = eventTxDone;
		break;
	case IRQ_RX_DONE:
		eventReceptor = eventRxDone;
		break;
	case IRQ_RX_TX_TIMEOUT:
		if (SUBGRF_GetOperatingMode() == MODE_TX)
		{
			eventReceptor = eventTxTimeout;
		}
		else if (SUBGRF_GetOperatingMode() == MODE_RX)
		{
			eventReceptor = eventRxTimeout;
		}
		break;
	case IRQ_CRC_ERROR:
		eventReceptor = eventRxError;
		break;
	default:
		break;
	}
}


/**
 * @brief  Process the TX Done event
 * @param  fsm pointer to FSM context
 * @retval None
 */
void eventTxDone(pingPongFSM_t *const fsm)
{
#if TRANSMIT_ONLY == 1 & RECEIVING_ONLY == 0
	HAL_UART_Transmit(&huart2, (uint8_t *)"Event TX Done\r\n", 15, HAL_MAX_DELAY);
#endif
#if TRANSMIT_ONLY == 0 & RECEIVING_ONLY == 0
	HAL_UART_Transmit(&huart2, (uint8_t *)"Event TX Done\r\n", 15, HAL_MAX_DELAY);
	switch (fsm->state)
	{
	case STATE_MASTER:
		switch (fsm->subState)
		{
		case SSTATE_TX:
			enterMasterRx(fsm);
			fsm->subState = SSTATE_RX;
			break;
		default:
			break;
		}
		break;
		case STATE_SLAVE:
			switch (fsm->subState)
			{
			case SSTATE_TX:
				enterSlaveRx(fsm);
				fsm->subState = SSTATE_RX;
				break;
			default:
				break;
			}
			break;
			default:
				break;
	}
#endif
}


/**
 * @brief  Process the RX Done event
 * @param  fsm pointer to FSM context
 * @retval None
 */
void eventRxDone(pingPongFSM_t *const fsm)
{
	//GS FSM - using event
	uint8_t payloadLength = 0;
	uint8_t rxStartBufferPointer = 0;
	//get payload
	SUBGRF_GetRxBufferStatus(&payloadLength, &rxStartBufferPointer);
	//read payload
	SUBGRF_ReadBuffer(rxStartBufferPointer, (uint8_t *)fsm->rxBuffer, payloadLength);
	HAL_UART_Transmit(&huart2, (uint8_t *)fsm->rxBuffer, 20, HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart2, (uint8_t *)"Rx DONE - Received packet", 25, HAL_MAX_DELAY);
	//END GS FSM - using event
}


/**
 * @brief  Process the TX Timeout event
 * @param  fsm pointer to FSM context
 * @retval None
 */
void eventTxTimeout(pingPongFSM_t *const fsm)
{
	HAL_UART_Transmit(&huart2, (uint8_t *)"Event TX Timeout\r\n", 18, HAL_MAX_DELAY);
}


/**
 * @brief  Process the RX Timeout event
 * @param  fsm pointer to FSM context
 * @retval None
 */
void eventRxTimeout(pingPongFSM_t *const fsm)
{
	HAL_UART_Transmit(&huart2, (uint8_t *)"Event RX Timeout\r\n", 18, HAL_MAX_DELAY);
}


/**
 * @brief  Process the RX Error event
 * @param  fsm pointer to FSM context
 * @retval None
 */
void eventRxError(pingPongFSM_t *const fsm)
{
	HAL_UART_Transmit(&huart2, (uint8_t *)"Event Rx Error\r\n", 16, HAL_MAX_DELAY);
}


/**
 * @brief  Entry actions for the RX sub-state of the Master state
 * @param  fsm pointer to FSM context
 * @retval None
 */
void enterMasterRx(pingPongFSM_t *const fsm)
{
	//GS FSM - using event
	HAL_UART_Transmit(&huart2, (uint8_t *)"Master Rx start\r\n", 17, HAL_MAX_DELAY);
	SUBGRF_SetDioIrqParams( IRQ_RX_DONE | IRQ_RX_TX_TIMEOUT | IRQ_CRC_ERROR | IRQ_HEADER_ERROR,
			IRQ_RX_DONE | IRQ_RX_TX_TIMEOUT | IRQ_CRC_ERROR | IRQ_HEADER_ERROR,
			IRQ_RADIO_NONE,
			IRQ_RADIO_NONE );
	packetParams.Params.LoRa.PayloadLength = 20; //this may not be necessary -> expecting 20 bytes
	SUBGRF_SetPacketParams(&packetParams);
	SUBGRF_SetSwitch(RFO_LP, RFSWITCH_RX);
	SUBGRF_SetRx(7000 << 6); //7 second wait
	//END GS FSM - using event
}


/**
 * @brief  Entry actions for the RX sub-state of the Slave state
 * @param  fsm pointer to FSM context
 * @retval None
 */
void enterSlaveRx(pingPongFSM_t *const fsm)
{
//
}


/**
 * @brief  Entry actions for the TX sub-state of the Master state
 * @param  fsm pointer to FSM context
 * @retval None
 */
void enterMasterTx(pingPongFSM_t *const fsm)
{
    //not used
	HAL_UART_Transmit(&huart2, (uint8_t *)"Master Tx start\r\n", 17, HAL_MAX_DELAY);
	SUBGRF_SetSwitch(RFO_LP, RFSWITCH_TX);
    SUBGRF_WriteRegister(0x0889, (SUBGRF_ReadRegister(0x0889) | 0x04));
	packetParams.Params.LoRa.PayloadLength = 20;
	SUBGRF_SetPacketParams(&packetParams);
    SUBGRF_SendPayload((uint8_t *)"ABCDEFGHIJKLMNOPQRST", 20, 0);
    HAL_UART_Transmit(&huart2, (uint8_t*)"ABCDEFGHIJKLMNOPQRST\r\n", 20+2, HAL_MAX_DELAY);
}


/**
 * @brief  Entry actions for the TX sub-state of the Slave state
 * @param  fsm pointer to FSM context
 * @retval None
 */
void enterSlaveTx(pingPongFSM_t *const fsm)
{
//
}


/**
 * @brief  Transition actions executed on every RX Done event (helper function)
 * @param  fsm pointer to FSM context
 * @retval None
 */
void transitionRxDone(pingPongFSM_t *const fsm)
{
	// PacketStatus_t packetStatus;
	// char uartBuff[50];

	// // Workaround 15.3 in DS.SX1261-2.W.APP (because following RX w/ timeout sequence)
	// SUBGRF_WriteRegister(0x0920, 0x00);
	// SUBGRF_WriteRegister(0x0944, (SUBGRF_ReadRegister(0x0944) | 0x02));

