aizatsyafiq/STM32WLE5CCU-with-LoRa/1-Nucleo (as reference)/2 - GS FSM/nucleo gs fsm event.c
	// SUBGRF_GetPayload((uint8_t *)fsm->rxBuffer, &fsm->rxSize, 0xFF);
	// SUBGRF_GetPacketStatus(&packetStatus);

	// sprintf(uartBuff, "RssiValue=%d dBm, SnrValue=%d Hz\r\n", packetStatus.Params.LoRa.RssiPkt, packetStatus.Params.LoRa.SnrPkt);
	// HAL_UART_Transmit(&huart2, (uint8_t *)uartBuff, strlen(uartBuff), HAL_MAX_DELAY);
}

uint32_t GetBandwidthInHz(RadioLoRaBandwidths_t bandwidth){
	switch(bandwidth)
	{
	case LORA_BW_500: return 500000;
	case LORA_BW_250: return 250000;
	case LORA_BW_125: return 125000;
	case LORA_BW_062: return 62500;
	case LORA_BW_041: return 41670;
	case LORA_BW_031: return 31250;
	case LORA_BW_020: return 20830;
	case LORA_BW_015: return 15630;
	case LORA_BW_010: return 10420;
	case LORA_BW_007: return 7810;
	default: return 0; // Invalid bandwidth
	}
}

void showMenu(UART_HandleTypeDef *huart){
	HAL_UART_Transmit(huart, (uint8_t*)"\n\nCM IN GS MODE\r\n", 16, HAL_MAX_DELAY);
	HAL_UART_Transmit(huart, (uint8_t*)"************************************************\n", 49, HAL_MAX_DELAY);
	HAL_UART_Transmit(huart, (uint8_t*)"* SELECT OPTION :                              *\n", 49, HAL_MAX_DELAY);
	HAL_UART_Transmit(huart, (uint8_t*)"* [1] Transmit command to SM and enter RX MODE *\n", 49, HAL_MAX_DELAY);
	HAL_UART_Transmit(huart, (uint8_t*)"* [2] Display firmware info                    *\n", 49, HAL_MAX_DELAY);
	HAL_UART_Transmit(huart, (uint8_t*)"* [3] Change current UNIX time                 *\n", 49, HAL_MAX_DELAY);
	HAL_UART_Transmit(huart, (uint8_t*)"* [4] Display current datetime                 *\n", 49, HAL_MAX_DELAY);
	HAL_UART_Transmit(huart, (uint8_t*)"* [0] Display navigation menu                  *\n", 49, HAL_MAX_DELAY);
	HAL_UART_Transmit(huart, (uint8_t*)"************************************************\n\n", 50, HAL_MAX_DELAY);
}

void printBoardInfo(UART_HandleTypeDef *huart)
{
	char buffer[50];
	printUid(huart);
	snprintf(buffer, sizeof(buffer), "FW NAME : %s\r\n", FIRMWARE_FILENAME);
	HAL_UART_Transmit(huart, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
	HAL_Delay(50);
	snprintf(buffer, sizeof(buffer), "FW VER  : %s\r\n", FIRMWARE_VERSION);
	HAL_UART_Transmit(huart, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
	HAL_Delay(50);
	snprintf(buffer, sizeof(buffer), "FW DATE : %s\r\n", __DATE__);
	HAL_UART_Transmit(huart, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
	HAL_Delay(50);
}

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1)
	{
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
